Tekla Open API Reference for Tekla Structures 2025
BoltGroup.GetFatherPour Method
 Returns the pour that the bolt group is associated to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourObject GetFatherPour()
Public Function GetFatherPour As PourObject
Return Value
Type: PourObject
The pour object.
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace